Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: Builder pattern constructs complex objects step by step through a helper object
ru: Шаблон Builder строит сложные объекты шаг за шагом с помощью вспомогательного объекта

source: Bundling data with methods that operate on it and restricting direct access
ru: Соедините данные с методами, которые работают с ними, и ограничьте прямой доступ к ним

source: Buy
ru: Купить

source: Buy Subscription
ru: Купить подписку

source: By convention, a library starts at src/lib.rs
ru: По соглашению, библиотека начинается с src/lib.rs

source: By copy
ru: По экземпляру

source: By default a binary crate starts at src/main.rs
ru: По умолчанию бинарный файл crate начинается по адресу src/main.rs

source: By default println! is hidden, --show-output always displays it
ru: По умолчанию println! скрыт, --show-output всегда отображает его

source: By exposing implementation details
ru: Раскрывая детали реализации

source: By hiding internal state and preventing unauthorized access
ru: Скрывая внутреннее состояние и предотвращая несанкционированный доступ

source: By making everything public
ru: Если сделать все общедоступным

source: By name
ru: По имени

source: By reference
ru: По ссылке

source: By Reference
ru: По ссылке

source: By removing all methods
ru: Удалив все методы

source: By the Deserializer
ru: Десериализатором

source: By Unicode scalar boundaries - otherwise runtime error
ru: По границам скаляров Unicode - иначе ошибка времени выполнения

source: By value
ru: По стоимости

source: Bypass orphan rule and type safety
ru: Обход правила о сиротах и безопасность type

source: Bytes
ru: Байты

source: C strings are faster
ru: Строки C быстрее

source: C strings are null-terminated, Rust strings store their length
ru: Строки C имеют нуль-терминацию, строки Rust хранят свою длину

source: C strings store their length
ru: Строки C хранят свою длину

source: C uses null termination while Rust stores the length explicitly, which is a fundamental difference
ru: C использует нулевое завершение while Rust хранит длину явно, что является фундаментальным отличием

source: C++ has better type checking
ru: В C++ лучше проверка type

source: Call freeze() method
ru: Вызовите метод freeze()

source: Calling a method
ru: Вызов метода

source: Calls drop on a variable
ru: Падение вызовов на переменную

source: Calls drop on the owner
ru: Звонки падают на владельца

source: Calls the closure only on Err
ru: Вызывает закрытие только на Err

source: Can .. be used twice in one tuple pattern?
ru: Можно ли дважды использовать ... in в одном шаблоне кортежа?

source: Can &str be automatically converted to &String?
ru: Можно ли автоматически преобразовать &amp;str в &amp;String?

source: Can &String be automatically converted to &str?
ru: Можно ли автоматически преобразовать &amp;String в &amp;str?

source: Can #[non_exhaustive] be applied to enum variants?
ru: Можно ли применить #[non_exhaustive] к вариантам enum?

source: Can a type implement both Default and new()?
ru: Может ли type реализовать и Default, и new()?

source: Can be infinite
ru: Может быть бесконечным

source: Can be used again
ru: Можно использовать повторно

source: Can be used as names
ru: Можно использовать as имена

source: Can capture the environment
ru: Может запечатлеть окружающую среду

source: Can cause data race in multithreading
ru: Может вызвать гонку данных in многопоточность

source: Can different enum variants have different amounts and types of data?
ru: Могут ли разные варианты enum иметь разные объемы и типы данных?

source: Can have simultaneous immutable and mutable pointers to same location
ru: Можно одновременно иметь неизменяемые и изменяемые указатели на одно и то же место

source: Can individual function in extern block be marked as safe?
ru: Может ли отдельная функция in extern блока быть помечена как as безопасная?

source: Can iterate chars of string (for ch in "ab".chars())
ru: Можно итерировать символы строки (for ch in "ab".chars())

source: Can iterate ranges
ru: Можно итерировать диапазоны

source: Can lead to dependency hell with conflicting versions
ru: Может привести к аду зависимостей с конфликтующими версиями

source: Can mutate number inside list via borrow_mut()
ru: Можно изменять число внутри списка с помощью функции borrow_mut()

source: Can nested enum and struct be destructured?
ru: Могут ли вложенные enum и struct быть деструктурированы?

source: Can only be used in lib.rs
ru: Можно использовать только in lib.rs

source: Can only be used in main
ru: Можно использовать только in main

source: Can only mutate tail
ru: Может мутировать только хвост

source: Can only mutate through unsafe
ru: Может мутировать только через unsafe

source: Can Option be used as an iterator?
ru: Можно ли использовать Option быть использован as итератор?

source: Can raw pointers be created in safe code?
ru: Можно ли создавать сырые указатели in в безопасном коде?

source: Can Rc<T> be made thread-safe?
ru: Можно ли Rc<T> можно сделать безопасным для потоков?

source: Can reuse the builder as a template
ru: Возможность повторного использования конструктора as шаблона

source: Can Send/Sync be implemented manually?
ru: Можно ли реализовать отправку/синхронизацию вручную?

source: Can tasks move between threads?
ru: Могут ли задачи move перемещаться между потоками?

source: Can the borrow checker borrow struct fields independently?
ru: Может ли контролер заимствований самостоятельно заимствовать поля struct?

source: Can the Strategy pattern be implemented without traits in Rust?
ru: Можно ли реализовать паттерн Strategy без трейтов in Rust?

source: Can variants of an enum hold data?
ru: Могут ли варианты enum хранить данные?

source: Can you add methods to an enum?
ru: Можете ли вы добавить методы в enum?

source: Can you change the fields of a struct instance?
ru: Можно ли изменить поля экземпляра struct?

source: Can you combine threads and async?
ru: Можете ли вы объединить нити и async?

source: Can you dereference Box<T> with * operator?
ru: Можете ли вы разыменовать Box<T> с помощью оператора *?

source: Can you explicitly call the drop() method from Drop?
ru: Можете ли вы явно вызвать метод drop() из Drop?

source: Can you have &v[0] and call v.push(5) in the same scope?
ru: Можете ли вы иметь &amp;v[0] и вызывать v.push(5) in в одной и той же области видимости?

source: Can you have borrow() and borrow_mut() active simultaneously?
ru: Могут ли быть одновременно активны функции borrow() и borrow_mut()?

source: Can you have multiple impl blocks for one struct?
ru: Можно ли иметь несколько блоков impl for и один struct?

source: Can you have multiple senders (Sender) for one receiver (Receiver)?
ru: Можно ли иметь несколько отправителей (Sender) for одного получателя (Receiver)?

source: Can you implement an external trait for an external type?
ru: Можете ли вы реализовать внешний trait for и внешний type?

source: Can you iterate over Receiver as an iterator?
ru: Можете ли вы выполнять итерацию над получателем as?

source: Can you mix if let, else if, and else if let?
ru: Можно ли смешивать if let , else if , и else if let ?

source: Can you modify data through Rc<T>?
ru: Можете ли вы изменять данные через Rc<T>?

source: Can you override a default method?
ru: Можете ли вы override метод по умолчанию?

source: Can you return different types through impl Trait?
ru: Можете ли вы return различные типы через impl Trait?

source: Can you store a reference in a struct?
ru: Можете ли вы хранить ссылку in на struct?

source: Can you store unsized types (DST) in Box?
ru: Можете ли вы хранить unsized типов (DST) in Box?

source: Can you use ? in main?
ru: Вы можете use? in main?

source: Can you use ? on a Result inside a function returning Option?
ru: Можете ли вы use? на Result внутри функции, возвращающей Option?

source: Can you use #[should_panic] with tests returning Result<T,E>?
ru: Можете ли вы use #[should_panic] с тестами, возвращающими Result<T,E>?

source: Can you use move-closure and then use the moved variable in main thread?
ru: Можете ли вы use move -закрытие, а затем use перемещенную переменную in main поток?

source: Can, but only for Box<T>
ru: Можно, но только for Box<T>

source: Cancel
ru: Отменить

source: Cancels all futures
ru: Отменяет все фьючерсы

source: Cancels all futures except one
ru: Отменяет все фьючерсы, кроме одного

source: Cancels futures
ru: Отмена фьючерсов

source: Cannot allocate in tests
ru: Невозможно выделить in тестов

source: Cannot be fixed
ru: Невозможно исправить

source: Cannot be used
ru: Невозможно использовать

source: Cannot be used with traits
ru: Не может быть использован с чертами

source: Cannot capture
ru: Невозможно захватить

source: Cannot declare
ru: Невозможно объявить

source: Cannot have & and &mut simultaneously - clear() needs &mut while w is alive
ru: Невозможно иметь &amp; и &amp;mut одновременно - clear() требует &amp;mut while w is alive

source: Cannot have Nil in enum
ru: Не может быть ни одного in enum

source: Cannot implement an external trait for an external type
ru: Невозможно реализовать внешний trait for внешний type

source: Cannot mutate
ru: Не может мутировать

source: Cannot return
ru: Невозможно return

source: Cannot work
ru: Не могу работать

source: Captures ownership
ru: Захват собственности

source: Captures thread panic
ru: Захватывает нитяную панику

source: Captures variables by value
ru: Захват переменных по значению

source: cargo bin myproj
ru: грузовой контейнер myproj

source: cargo build
ru: сборка груза

source: cargo build --strict
ru: сборка груза --strict

source: cargo check
ru: проверка груза

source: Cargo chooses automatically
ru: Груз выбирается автоматически

source: Cargo chooses garden.rs
ru: Груз выбирает сад.рс

source: Cargo chooses mod.rs
ru: Cargo выбирает mod.rs

source: cargo clippy
ru: грузовой клиппи

source: cargo create
ru: создание груза

source: Cargo creates an empty module
ru: Cargo создает пустой модуль

source: Cargo doesn't know how
ru: Карго не знает, как

source: cargo init bin
ru: грузовой бункер

source: cargo init lib
ru: lib cargo init

source: cargo new creates a binary crate by default
ru: по умолчанию cargo new создает двоичный файл crate

source: cargo new mylib
ru: грузовой новый mylib

source: cargo new myproj
ru: новый груз myproj

source: cargo run
ru: грузовой пробег

source: cargo test
ru: груз test

source: cargo test -- --ignored
ru: груз test -- -- игнорируется

source: cargo test -- --test-threads=N
ru: груз test -- --test-threads=N

source: cargo test --ignore
ru: груз test --ignore

source: cargo test --limit=N
ru: груз test --limit=N

source: cargo test foo_test
ru: груз test foo_test

source: cargo test ignored-only
ru: груз test только для игнорирования

source: cargo test-only foo_test
ru: груз test-only foo_test

source: Cast directly to &str
ru: Кастинг прямо на &ampstr

source: Catch-all (any remaining case)
ru: Захват (любой оставшийся случай)

source: Catches panics
ru: Ловит паникеров

source: Causes compilation error
ru: Вызывает ошибку компиляции

source: chain creates one iterator from two
ru: цепочка создает один итератор из двух

source: Change type with the same name
ru: Изменить type с тем же именем

source: Change value
ru: Значение изменения

source: Changes between the original and clone are not synchronized
ru: Изменения между оригиналом и клоном не синхронизируются

source: Channels std::sync::mpsc are:
ru: Каналы std::sync::mpsc являются:

source: Char
ru: Шар

source: char in Rust:
ru: char in Ржавчина:

source: Characters
ru: Персонажи

source: Check with if in every function
ru: Проверьте с помощью if in каждую функцию

source: Checks a condition for true
ru: Проверяет условие for true

source: Checks borrows at runtime
ru: Проверяет заимствования во время выполнения

source: Checks Debug
ru: Чеки Debug

source: Checks equality of two values
ru: Проверяет равенство двух значений

source: Checks execution speed
ru: Проверяет скорость выполнения

source: Checks for Drop
ru: Чеки for Drop

source: Checks for equality
ru: Проверяет равенство for

source: Checks for inequality
ru: Проверяет for неравенство

source: Checks for Null
ru: Проверяет for Null

source: Checks for value presence
ru: Проверяет наличие значения for

source: Checks key existence
ru: Проверяет существование ключа

source: Checks only bool
ru: Только чеки bool

source: Checks syntax
ru: Проверяет синтаксис

source: Checks that references live long enough
ru: Проверяет, что ссылки живут достаточно долго

source: Checks the type
ru: Проверяет type

source: Checks type
ru: Чеки type

source: Checks type sizes
ru: Проверьте размеры type

source: Checks types of futures
ru: Проверяет типы фьючерсов

source: Checks whether one Rectangle fits inside another
ru: Проверяет, помещается ли один прямоугольник внутри другого

source: Child modules must live under the directory of their parent module
ru: Дочерние модули должны находиться в каталоге своего родительского модуля

source: Child threads are terminated when main exits
ru: Дочерние потоки завершаются при выходе из main

source: class Summary { … }
ru: класс Summary { ... }

source: Classes should always be open to modification
ru: Занятия всегда должны быть открыты для модификации

source: Classes should favor composition for code reuse over inheritance
ru: Классы должны отдавать предпочтение композиции for повторному использованию кода, а не наследованию

source: Classic concurrency philosophy
ru: Классическая философия параллелизма

source: cleanup! macro
ru: уборка! macro

source: Clear progress
ru: Сброс прогресса

source: Clearer and doesn't move arguments
ru: Яснее и без move аргументов

source: Clippy is a linting tool that can identify cases where .clone() is not necessary
ru: Clippy - это инструмент для линтинга, который может определить случаи, когда where.clone() не нужен

source: Clone and Copy
ru: Clone и Copy

source: Clone implementation
ru: Clone реализация

source: Clone in a block scope, then use move closure
ru: Clone in область действия блока, затем use move закрытие

source: Clone may be acceptable in learning situations, prototypes, or when readability is prioritized over performance
ru: Clone может быть приемлемым in учебных ситуаций, прототипов, или когда читабельность приоритетнее производительности

source: Clone sender for multiple producers
ru: Clone отправитель for несколько производителей

source: Clone the struct
ru: Clone сайт struct

source: Clones a struct
ru: Клоны а struct

source: Clones a value
ru: Клонирует значение

source: Clones the builder
ru: Клонирует строителя

source: Clones the struct
ru: Клонирует struct

source: Clones the value
ru: Клонирует значение

source: Clones value on each access
ru: Клонирует значение при каждом обращении

source: Cloning
ru: Клонирование

source: Cloning before the closure in a separate scope keeps the clone operation explicit and localized
ru: Клонирование перед закрытием in отдельной области видимости позволяет сделать операцию клонирования явной и локализованной

source: Cloning creates a separate copy of data, so modifications to one don't affect the other
ru: При клонировании создается отдельная копия данных, поэтому изменения в одной копии не влияют на другую

source: Cloning data for performance optimization
ru: Клонирование данных for оптимизация производительности

source: Cloning objects
ru: Клонирование объектов

source: close
ru: закрыть

source: Closure
ru: Закрытие

source: Closure must have return
ru: Закрытие должно иметь return

source: Closure syntax uses vertical bars ||
ru: В синтаксисе закрытия используются вертикальные полосы ||

source: Closure type is fixed on first call
ru: Закрытие type фиксируется по первому звонку

source: Closure types are inferred, but sometimes clarification is needed
ru: Типы закрытия предполагаются, но иногда требуется уточнение

source: Closures are returned via impl Trait syntax
ru: Закрытия возвращаются с помощью синтаксиса impl Trait

source: Closures can be used to implement strategy pattern by passing functions as parameters
ru: Закрытия можно использовать для реализации паттерна стратегии, передавая функции as параметры

source: Closures have no body
ru: У закрытий нет тела

source: Code and Code
ru: Код и кодекс

source: Code for the arm goes after =>. It's part of match syntax
ru: В коде for рука идет после =&gt;. Это часть синтаксиса match

source: Code inside helper functions isn't invoked during testing, only checked for compilation
ru: Код внутри вспомогательных функций не вызывается во время тестирования, а только проверяется for компиляции

source: Code is shorter
ru: Код короче

source: Code runs faster
ru: Код работает быстрее

source: Code should be open source
ru: Код должен быть с открытым исходным кодом

source: Code that works with data of multiple types
ru: Код, работающий с данными нескольких типов

source: Code that writes other code
ru: Код, который пишет другой код

source: Code with errors
ru: Код с ошибками

source: Coin::Quarter(state) => println!("{state:?}"). match can destructure and bind
ru: Монета::Quarter(state) =&gt; println!("{state:?}"). match может деструктурировать и связывать

source: collect
ru: собирать

source: collect can be parameterized into different collections
ru: collect может быть параметризован в различные коллекции

source: collect requires mut
ru: собирать требует mut

source: collection![]
ru: коллекция![]

source: Combine all operations into one method
ru: Объедините все операции в один метод

source: Combine items into a single value
ru: Объедините элементы в одно значение

source: Combines data into a single item
ru: Объединяет данные в один элемент

source: Combines futures into one
ru: Объединяет фьючерсы в один

source: Combines multiple ownership with runtime-checked mutation
ru: Сочетание множественного владения с мутацией, проверяемой во время выполнения

source: Combines multiple streams into one, yielding items as they arrive
ru: Объединяет несколько потоков в один, получая элементы по адресу as

source: Combines two iterators into tuples
ru: Объединяет два итератора в кортежи

source: Combining multiple types into one
ru: Объединение нескольких типов в один

source: Combining traits into one
ru: Объединение признаков в один

source: Comments
ru: Комментарии

source: Comments:
ru: Комментарии:

source: Common Collections
ru: Общие коллекции

source: Common fields are de-duplicated across states
ru: Общие поля дублируются в разных штатах

source: Common Programming Concepts
ru: Общие концепции программирования

# common_collections_link
source: https://doc.rust-lang.org/book/ch08-00-common-collections.html
ru: https://doc.rust-lang.ru/book/ch08-00-common-collections.html

# common_programming_concepts_link
source: https://doc.rust-lang.org/book/ch03-00-common-programming-concepts.html
ru: https://doc.rust-lang.ru/book/ch03-00-common-programming-concepts.html

source: Compares a value against patterns
ru: Сравнивает значение с образцами

source: Compares two numbers
ru: Сравнивает два числа

source: Compares width and height. Example from the chapter
ru: Сравнивает ширину и высоту. Пример из главы

source: Comparison requires PartialEq, printing requires Debug
ru: Сравнение требует PartialEq, печать требует Debug

source: Compilation breaks
ru: Перерывы в компиляции

source: Compilation error
ru: Ошибка компиляции

source: Compilation error - method doesn't exist for that type
ru: Ошибка компиляции - метод не существует for что type

source: Compilation error (different branch types)
ru: Ошибка компиляции (различные типы ветвей)

source: Compilation error because of missing semicolon after 5
ru: Ошибка компиляции из-за отсутствия точки с запятой после 5

source: Compilation error: assignment to immutable variable
ru: Ошибка компиляции: присвоение неизменяемой переменной

source: Compilation error: value was moved
ru: Ошибка компиляции: значение было перемещено

source: Compilation errors
ru: Ошибки компиляции

source: Compilation fails
ru: Сбой компиляции

source: Compilation speed
ru: Скорость компиляции

source: Compile error
ru: Ошибка компиляции

source: Compile error (borrow conflict)
ru: Ошибка компиляции (конфликт заимствований)

source: Compile error (E0502)
ru: Ошибка компиляции (E0502)

source: Compile error: use of moved value
ru: Ошибка компиляции: use перемещенного значения

source: Compile-time error
ru: Ошибка времени компиляции

source: Compile-time vs. runtime
ru: Время компиляции и время выполнения

source: Compiler allows, but checks (number of Ref/RefMut) are performed at runtime
ru: Компилятор разрешает, но проверки (количество Ref/RefMut) выполняются во время выполнения

source: Compiler automatically inserts deref calls to match expected reference type
ru: Компилятор автоматически вставляет вызовы deref, чтобы match ожидаемую ссылку type

source: Compiler doesn't check exhaustiveness for if let, unlike match
ru: Компилятор не проверяет исчерпываемость for if let , в отличие от match

source: Compiler doesn't check exhaustiveness when using match guards
ru: Компилятор не проверяет исчерпанность при использовании защит match

source: Compiler doesn't know method at compile time
ru: Компилятор не знает метод во время компиляции

source: Compiler doesn't perform LTO by default
ru: Компилятор по умолчанию не выполняет LTO

source: Compiler doesn't support references in threads
ru: Компилятор не поддерживает ссылки in потоков

source: Compiler doesn't support such enums
ru: Компилятор не поддерживает такие перечисления

source: Compiler error
ru: Ошибка компилятора

source: Compiler flag --abort
ru: Флаг компилятора --abort

source: Compiler forbids
ru: Компилятор запрещает

source: Compiler knows called method at compile time
ru: Компилятор знает вызываемый метод во время компиляции

source: Compiler knows method at compile time
ru: Компилятор знает метод во время компиляции

source: Compiler prevents accidental mutations after processing
ru: Компилятор предотвращает случайные мутации после обработки

source: Compiler requirement
ru: Требование к компилятору

source: Compiler usually infers types automatically
ru: Компилятор обычно выводит типы автоматически

source: Compiles
ru: Компилируется

source: Compiles and copies value
ru: Компилирует и копирует значение

source: Compiles and crashes
ru: Компилируется и разбивается

source: Compiles async code
ru: Компилирует код async

source: Compiles macro
ru: Компилируется macro

source: Compiles macros
ru: Компилирует макросы

source: Compiles to C
ru: Компилируется в C

source: Compiles with a warning
ru: Компилируется с предупреждением

source: Compiles, but UB
ru: Компилируется, но UB

source: Complete absence of errors
ru: Полное отсутствие ошибок

source: Completed
ru: Завершен

source: Completely removes the test
ru: Полностью удаляет test

source: Completely replaced garden.rs
ru: Полностью заменен сад.рс

source: Complex pattern
ru: Сложный узор

source: Components should always surprise users
ru: Компоненты всегда должны удивлять пользователей

source: Composition provides greater flexibility than inheritance by allowing dynamic behavior assembly
ru: Композиция обеспечивает большую гибкость, чем наследование, позволяя собирать динамическое поведение

source: Composition provides more flexibility by containing instances of other classes rather than inheriting
ru: Композиция обеспечивает большую гибкость, поскольку содержит экземпляры других классов, а не наследует их

source: Concatenates strings
ru: Конкатенирует строки

source: Concatenates Vec
ru: Конкатенирует Vec

source: Concrete type Draw
ru: Бетон type Рисунок

source: Concurrency pattern
ru: Модель параллелизма

source: Concurrency requires multithreading
ru: Для параллелизма требуется многопоточность
